import React from 'react'
import './index.less'

export default () => {
  return (
    <div className='logout-privacy'>
        <h3>【联线心动】注销协议</h3>
        <p className='title-sub'>尊敬的【联线心动】用户：
        欢迎您使用【联线心动】交友平台（以下简称“本平台”）。为了保障您的合法权益，确保您在注销账户过程中的体验顺畅，特制定本注销协议（以下简称“协议”）。请您在申请注销账户前，仔细阅读并理解以下内容。</p>
        <ol >
            <li>注销资格</li>
            <ul className='inner-ul'>
                <li>您需为【联线心动】的注册用户，且账户状态正常。</li>
                <li>您应确保在申请注销前，已妥善处理与本平台其他用户之间的互动信息，包括但不限于聊天记录、礼物、关注关系等。</li>
                <li>3如您的账户存在未完成的交易、纠纷或违反本平台规则的行为，需在解决上述问题后方可申请注销。</li>
            </ul>
            <li>注销流程</li>
            <ul className='inner-ul'>
                <li>账户审核：您需通过【联线心动】App内提供的注销功能发起申请。提交申请时，系统将对您的账户进行初步审核，以确认是否满足注销条件。</li>
                <li>信息确认：为确保账户安全，您可能需要验证身份信息，如手机号码、邮箱或通过人脸识别等安全验证方式。</li>
                <li>数据处理：在您成功通过验证后，我们将开始处理您的账户数据，包括但不限于个人信息、聊天记录、发布内容等。根据相关法律法规要求，部分数据可能会被匿名化处理而非完全删除。</li>
                <li>注销完成：数据处理完毕后，您的账户将正式从【联线心动】平台注销，无法恢复。请慎重考虑您的决定。</li>
            </ul>
            <li>注意事项</li>
            <ul className='inner-ul'>
                <li>数据删除：注销后，您的个人信息及在平台上的活动记录将依据法律法规的要求进行删除或匿名化处理。请注意，由于技术限制或法律规定，某些数据可能无法完全删除。</li>
                <li>服务终止：注销账户后，您将无法再登录或使用本平台的任何服务，与账户相关的所有权益也将随之终止。</li>
                <li>不可逆性：一旦账户注销完成，所有操作不可逆，包括账户恢复及数据找回。</li>
                <li>法律与合规：本平台保留根据法律法规要求，对特定情况下的用户数据进行保留或提供给相关部门的权利。</li>
            </ul>
            <li>协议变更</li>
            <p>本协议可能会根据法律法规的变化或平台运营需要进行修订。任何修订后的协议将在公布于本平台时即时生效。请您定期查看本协议的最新版本。</p>
            <li>同意与接受</li>
            <p>您在【联线心动】App内提交注销申请即视为已充分理解并同意本协议的所有条款。若您对本协议有任何疑问，建议在提交注销申请前，通过客服渠道获取帮助和解答。</p>
            <p>感谢您对【联线心动】的支持与理解！我们希望在您未来的生活中，无论线上还是线下，都能遇到更多美好的心动时刻。</p>
        </ol>
        
        </div>
  )
}
